ErpTest/src/Catalogs/уатПрейскурантыТС/уатПрейскурантыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПрейскурантыТС</name>
  <comment>Прейскуранты на транспортные услуги (уат)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Валюта</name>
    <comment>Валюта</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/Catalogs/уатТарифыТС/уатТарифыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатТарифыТС</name>
  <comment>Тарифы на транспортные услуги (уат)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.уатПрейскурантыТС</owners>
  <attributes>
    <name>ГруппировкаТарифа1</name>
    <comment>Группировка тарифа 1</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаТарифа2</name>
    <comment>Группировка тарифа 2</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаТарифа3</name>
    <comment>Группировка тарифа 3</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрВыработки</name>
    <comment>Параметр выработки</comment>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяВыработка</name>
    <comment>Минимальная выработка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураУслуги</name>
    <comment>Номенклатура услуги</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СложныйТариф</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <comment>Тариф</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированныйТариф</name>
    <comment>Фиксированный тариф</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <comment>Время начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <comment>Время окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьДействияУдалить</name>
    <comment>Удалить в релизе 2.0.3. Значение реквизита из УАТ Стандарт1</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тарифы</name>
    <comment>Тарифы</comment>
    <attributes>
      <name>ЗнакГруппировки1</name>
      <comment>Знак группировки 1</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакГруппировки2</name>
      <comment>Знак группировки 2</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакГруппировки3</name>
      <comment>Знак группировки 3</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки1</name>
      <comment>Значение группировки 1</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки2</name>
      <comment>Значение группировки 2</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки3</name>
      <comment>Значение группировки 3</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <comment>Тариф</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Catalogs/уатПрейскурантыТС/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформлениеОбластьДействия();
	
	// УправлениеПредприятием.СлужебныеПодсистемы
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Конец УправлениеПредприятием.СлужебныеПодсистемы
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеТарифаТС" Тогда
		УстановитьУсловноеОформлениеОбластьДействия();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Дерево.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Родитель",,,, Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Родитель", ТекСтрока.Ссылка, 
			ВидСравненияКомпоновкиДанных.ВИерархии);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Тарифы.Отбор, "Владелец", Неопределено);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПериодыДействия.Отбор, "Прейскурант", Неопределено);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Тарифы.Отбор, "Владелец", ТекСтрока.Ссылка);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПериодыДействия.Отбор, "Прейскурант", ТекСтрока.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// УправлениеПредприятием.СлужебныеПодсистемы
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец УправлениеПредприятием.СлужебныеПодсистемы

&НаКлиенте
Процедура Калькулятор(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.уатКалькуляторТарифов.Форма", Новый Структура("Прейскурант", ТекСтрока.Ссылка))
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДействующиеПрейскуранты(Команда)
	
	ПрейскурантСсылка = Элементы.Список.ТекущаяСтрока;
	Если ПрейскурантСсылка = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор",                   Новый Структура("Прейскурант", ПрейскурантСсылка));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.уатДействующиеПрейскуранты.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеОбластьДействия()
	УслОформление = Тарифы.УсловноеОформление.Элементы;
	
	ВыборкаТарифы = Справочники.уатТарифыТС.Выбрать();
	Пока ВыборкаТарифы.Следующий() Цикл
		Если ВыборкаТарифы.ОбластьДействия = NULL Тогда
			мФильтр = "";
		Иначе
			ТекОбластьДействия = ВыборкаТарифы.ОбластьДействия.Получить();
			Если ТипЗнч(ТекОбластьДействия) <> Тип("НастройкиКомпоновкиДанных")
					ИЛИ ТекОбластьДействия.Отбор.Элементы.Количество() = 0 Тогда
				мФильтр = "";
			Иначе
				мФильтр = уатОбщегоНазначенияТиповые.уатПолучитьПредставлениеОтбора(ТекОбластьДействия.Отбор);
			КонецЕсли;
		КонецЕсли;
		
		НовыйЭлементУслОформления = УслОформление.Добавить();
		офЭл = НовыйЭлементУслОформления.Поля.Элементы.Добавить();
		офЭл.Поле = Новый ПолеКомпоновкиДанных("ОбластьДействияПредставление");
		НовыйЭлементУслОформления.Оформление.УстановитьЗначениеПараметра("Текст", мФильтр);
		НовыйЭлементОтбора = НовыйЭлементУслОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = ВыборкаТарифы.Ссылка;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
